[
    {
        "title": "Emma Rose Baby Boutique",
        "image": "images/portfolio/emmarose.jpg",
        "description": "This web application is an e-commerce website that displays and sales Handmade Children Clothing for Infants and Toddlers. This is a fully functional ecommerce web application that features: product browsing by category and keyword, user login, user information entry and update, favorite product selection, product review, shopping cart, checkout and payment gateway using Paypal Express.",
        "role": " In charge of the design, layout and functionality of the Front End using HTML, CSS, Javascript, jQuery and Bootstrap. Also in charge of setting all Front and Back end routes to interact with the database (MySQL) using PHP and Laravel framework.",
        "url": "https://emmarosebabyboutique.com/",
        "github": "https://github.com/jaab30/emmaroseproject",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Bootstrap",
            "PHP",
            "Laravel",
            "MySQL",
            "Full CRUD"
        ]
    },
    {
        "title": "Ticket Generator",
        "image": "images/portfolio/tixGen.jpg",
        "description": "This is a Full Stack MERN application designed to create tickets or work orders. It was created to maximize communication within employees in an organization and also between users and administration in a larger scale environments. This application uses JWT to handle Authentication and Redux to handle React state.",
        "role": "Led the full design and functionality of this application. Managed the design, layout, and functionality of the Front-End using React, Redux, Reactstrap and Redux Middleware (Thunk). Developed all Back-End functionality with Node.js and Express, and all the API and HTML routes to listen for all HTTP requests and interact with the database. Configured JWT processes for user authentication. Built all models and interaction with database using MongoDB",
        "url": "http://ec2-18-220-148-152.us-east-2.compute.amazonaws.com/",
        "github": "https://github.com/jaab30/ticketGen",
        "webTools": [
            "React",
            "Redux",
            "JSX",
            "CSS3",
            "JavaScript",
            "NODE",
            "Express",
            "Reactstrap",
            "JWT",
            "MongoDB",
            "Full CRUD",
            "Restful APIs"
        ]
    },
    {
        "title": "Passport Auth Boiler Plate",
        "image": "images/portfolio/passport_auth1.jpg",
        "description": "This is a ready to use boiler plate that uses Passport for User Authentication and MySQL with Sequelize for Data Storage.",
        "role": " In charge of the design, layout and functionality of the Front End using HTML, CSS, Javascript, Bootstrap. Also in charge of setting all Front and Back end routes to interact with Passport and MySQL",
        "url": "https://passport-auth-boiler-plate.herokuapp.com/",
        "github": "https://github.com/jaab30/passport_mysql_sequelize_boiler_plate",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "Bootstrap",
            "NODE",
            "Express",
            "MySQL",
            "Sequelize",
            "Passport"
        ]
    },
    {
        "title": "Task Planner - CRUD",
        "image": "images/portfolio/taskPlannerNodeB.jpg",
        "description": "This web application is a simple but very professional looking Task Planner. Fully CRUD using NodeJs, Express, Handlebars and Sequelized (MySQL). Use MVC model folder structure. Simply enter your database credentials in the '.env' file and it is ready to use.",
        "role": "In charge of the layout and functionality of the Front End using HTML, CSS, Javascript, jQuery and Materialize. In charge of setting all the Backend functionality with NodeJs and Express. Setting all API and HTML routes to listen for all HTTP requests from the front end and interact with the database using MySQL. Setup for the MySQL database with table schemes and seeds.",
        "url": "https://todolist-crud-node.herokuapp.com/",
        "github": "https://github.com/jaab30/task-planner",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Materialize",
            "NODE",
            "Express",
            "Handlebars",
            "Full CRUD",
            "Sequelize",
            "MySQL",
            "Restful APIs"
        ]
    },
    {
        "title": "Intake - Low Carb Recipe Search",
        "image": "images/portfolio/project2.jpg",
        "description": "The main functionality for this web application is to perform searches for 'Low Carb' recipes. In addition, the application will show the user 'Featured and Trendy Recipes'. The user will also be able to 'Save' favorite recipes to the 'favorite List' as well as being able to submit their own recipe for other users to try.",
        "role": "In charge of the layout and functionality of the Front End using HTML, CSS, Javascript, jQuery. In charge of setting all the Backend functionality with NodeJs and Express. Setting all API and HTML routes to listen for all HTTP requests from the front end and interact with the database using MySQL. Setup for the MySQL database with table schemes and seeds.",
        "url": "https://powerful-earth-43399.herokuapp.com/",
        "github": "https://github.com/jaab30/recipe_search",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "NODE",
            "Express",
            "Handlebars",
            "Full CRUD",
            "Sequelize",
            "MySQL",
            "Restful APIs"
        ]
    },
    {
        "title": "Clicky Game",
        "image": "images/portfolio/clicky.jpg",
        "description": "This web application is a game where the user clicks on the images and get a score depending on the rules of the game. When the application starts, it displays a message for the user with the instructions of the game as well as it displays a set of images. The main rule of the game is to click on the images one at a time and to make sure not to click on the same image twice in a row. When user clicks on an image, the application shuffles the images.",
        "role": "In charge of the design, layout and functionality of the Front End using React, JSX and CSS.",
        "url": "https://jaab30.github.io/clicky-game-reacthooks/",
        "github": "https://github.com/jaab30/clicky-game-reacthooks",
        "webTools": [
            "React",
            "JSX",
            "CSS3",
            "JavaScript",
            "NODE"
        ]
    },
    {
        "title": "User Transaction",
        "image": "images/portfolio/ticketApp2.jpg",
        "description": "The main functionallity for this application is to create tickets for a specific user and store the tickets ONLY using Redux. The user can enter and update the user information. The user can also create, view, update and delete tickets. There is NO persistent data. This Application was only created to demonstrate the use of Redux and the store to update state and make it available to all the components.",
        "role": "In charge of the design, layout and full functionality of the Front End and Redux Store using React, Redux, JSX and CSS.",
        "url": "https://jaab30.github.io/user-transaction-redux",
        "github": "https://github.com/jaab30/user-transaction-redux",
        "webTools": [
            "React",
            "Redux",
            "JSX",
            "CSS3",
            "JavaScript",
            "NODE"
        ]
    },
    {
        "title": "Google Books Search",
        "image": "images/portfolio/googlesearch.jpg",
        "description": "The main functionality for this web application is to perform searches for Books using Google Book's API. In addition, the application will let the user save their favorite books to the user's 'Saved Book' page where the user will be able to view the books or delete them from the 'Saved Books' page.",
        "role": "Full Design and functionality of this full MERN stack application.  In charge of the design, layout and functionality of the Front End using React, JSX and CSS. In charge of setting all the Backend functionality with NodeJs and Express. Setting all API and HTML routes to listen for all HTTP requests from the front end and interact with the database. Setting all Models and interaction with the database using MongoDB.",
        "url": "https://google-search-react.herokuapp.com/books",
        "github": "https://github.com/jaab30/google-book-search",
        "webTools": [
            "React",
            "JSX",
            "CSS3",
            "JavaScript",
            "NODE",
            "Express",
            "Full CRUD",
            "MongoDB",
            "React",
            "MERN",
            "Restful APIs"
        ]
    },
    {
        "title": "RM Scraper",
        "image": "images/portfolio/scraper.jpg",
        "description": "The main function for this application is to 'Scrape' articles from a website and display them on the user's page. This application is scraping articles from the 'Real Madrid' website. Real Madrid is an entity that owns soccer and basketball teams from the spanish league and the articles are related to what's going on with those teams.",
        "role": "In charge of the layout and functionality of the Front End using HTML, CSS, Javascript, jQuery. In charge of setting all the Backend functionality with NodeJs and Express. Setting all API and HTML routes to listen for all HTTP requests from the front end and interact with the database. Setting all Models and interaction with the database using MongoDB.",
        "url": "https://mongo-scraper-ja.herokuapp.com/",
        "github": "https://github.com/jaab30/mongo_scraper",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Handlebars",
            "NODE",
            "Express",
            "Full CRUD",
            "MongoDB",
            "Restful APIs"
        ]
    },
    {
        "title": "Employee Management List",
        "image": "images/portfolio/employee.jpg",
        "description": "This is a simple web application that renders random users from: \"randomuser.me\" API when the application first starts. This application is created using React Hooks and let the user search by Last Name. It updates the results everytime the user enters a letter on the search input field. It also sorts employees by First Name, Last Name and Age",
        "role": "In charge of the design, layout and functionality of the Front End using React, JSX, Bootstrap and CSS.",
        "url": "https://jaab30.github.io/employee-management",
        "github": "https://github.com/jaab30/employee-management",
        "webTools": [
            "React",
            "JSX",
            "CSS3",
            "JavaScript",
            "NODE",
            "Server-Side API"
        ]
    },
    {
        "title": "Event Concierge",
        "image": "images/portfolio/project1.jpg",
        "description": "A web application that searches all types of events in the United States. User can also buy tickets and book an UBER ride from within the application. It also let the user saves favorite searches on their Wish List area to be accessed at any time.",
        "role": "Front End Lead Developer (team of 4).",
        "url": "https://jaab30.github.io/event_concierge/",
        "github": "https://github.com/jaab30/event_concierge",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Bootstrap"
        ]
    },
    {
        "title": "React Web Portfolio",
        "image": "images/portfolio/portfolio.jpg",
        "description": "This web application is a simple portfolio created in React. The app has five pages. Uses Parallax and smooth page scrolling. The Project page will filter projects by cartegory (web tools).",
        "role": "In charge of the design, layout and functionality of the Front End using React, JSX and CSS.",
        "url": "https://jaab30.github.io/react-ja-porfolio",
        "github": "https://github.com/jaab30/react-ja-porfolio",
        "webTools": [
            "React",
            "JavaScript",
            "CSS3",
            "Bootstrap"
        ]
    },
    {
        "title": "Trivia Game",
        "image": "images/portfolio/triviagame.jpg",
        "description": "This is a Trivia Game based on the Seinfeld TV Series. The game will go through a series of 10 questions. Each question has a time limit of 30 seconds. If the user Clicks on the correct answer, the application will display an image (gif) from the TV Series. If the user clicks on the wrong answer, the application will show the correct answer.",
        "role": "Front End Developer.",
        "url": "https://jaab30.github.io/TriviaGame/",
        "github": "https://github.com/jaab30/TriviaGame",
        "webTools": [
            "HTML5",
            "CSS3",
            "JavaScript",
            "jQuery",
            "Bootstrap"
        ]
    }
]