[
    {
        "employer": "TRILOGY EDUCATION / UCF",
        "employer_sub": "University of Central Florida Coding Bootcamp",
        "position": "Teacher Assistant - Web Development Program",
        "description": [
            "Assist the lead instructor with preparation and facilitation of classes for students attending UCF's Full Stack Web Development Coding Bootcamp Program.",
            "Topics of subjects taught include: HTML5, CSS3, JavaScript (ES6), Node.js, Express, React, jQuery, Bootstrap, Firebase, MySQL, MongoDB, REST APIs, MVC, Handlebars, PHP, PHP Frameworks, Agile, Scrum & GitHub Version Control Platform.",
            "Train and mentor over 20+ students daily, each over a 3-month period, to design and develop user-friendly applications. These students go on to start coding careers at well-respected companies in the industry. ",
            "Provide support to students by reviewing web applications and assisting them with troubleshooting issues and fixing application functionality.",
            "Deliver weekly coding sessions and reviews to help the students understand and develop coding techniques.",
            "Distinguished as an excellent Teaching Assistant and invited to teach at two classes simultaneously (Full-Time and Part-Time). "
        ],
        "image": "images/trilogy.png"
    },
    {
        "employer": "FULL SAIL UNIVERSITY",
        "employer_sub": "",
        "position": "Instructor - Lab Specialist",
        "description": [
            "Taught students how to utilize Music Software Applications to be used to write and produce Music.",
            "Formally commended by Program Director for leading students to successfully complete class objectives.",
            "Provided support to over 200 students monthly with equipment and software set up as well as implementing troubleshooting techniques to solve computer and/or software issues.",
            "Prepared students for success when taking various standardized tests required by the state."
        ],
        "image": "images/fullsail.png"
    },
    {
        "employer": "YRS MIDI Systems",
        "employer_sub": "",
        "position": "Software Support / Web",
        "description": [
            "Creation, design and maintenance of Store Web Page.",
            "Keep all web content up to date ( ie. new inventory, prices, product availability, etc )",
            "Responsible for installation, maintenance and support of software applications.",
            "Responsible for instructing clients on how to utilize new software applications and how to apply troubleshooting techniques to solve software issues."
        ],
        "image": "images/yrs.png"
    }
]